[Assault X2UniversalSoldierClassInfo]
ClassSpecializationTitle=突击兵
ClassSpecializationSummary="总是作为地面上的第一只和最后一只部队，这只部队是专注并具有破坏性。如果你期望快速反应和侦察，你需要突击兵上场. "

[Infantry X2UniversalSoldierClassInfo]
ClassSpecializationTitle=步兵
ClassSpecializationSummary="我肩上扛着枪，腰带上有颗手榴弹。步兵可能不是最强壮的士兵，但你可以依靠他来守住防线."

[Sentinel X2UniversalSoldierClassInfo]
ClassSpecializationTitle=哨兵
ClassSpecializationSummary="眼睛盯着地平线，手则放在扳机上。哨兵时刻警惕着敌人的活动."

[Gunner X2UniversalSoldierClassInfo]
ClassSpecializationTitle=机枪手
ClassSpecializationSummary="三脚架，高容量的弹夹，和一地的空壳。如果你想要什么东西被火力封锁或弄得满是窟窿，就呼叫机枪手，躲在他后面."

[Grenadier X2UniversalSoldierClassInfo]
ClassSpecializationTitle=榴弹兵
ClassSpecializationSummary="自从人类找到了一种方法，将炸药装进一个方便携带的便携容器后，掷弹兵就给敌人带来了很大的麻烦。不管是黑火药还是Hi-Ex，结果都是一样的."

[Sniper X2UniversalSoldierClassInfo]
ClassSpecializationTitle=狙击手
ClassSpecializationSummary="如果有需要拿下的人或野兽，你可以依靠狙击手来完成任务，保证一枪一个。把高地给他，他就会把战场控制权交给你."

[Ranger X2UniversalSoldierClassInfo]
ClassSpecializationTitle=游侠
ClassSpecializationSummary="手持刀刃，脚踏实地。有时候，你可能会遇到只能靠老式暴力解决的情景，你需要游侠."

[Hacker X2UniversalSoldierClassInfo]
ClassSpecializationTitle=黑客
ClassSpecializationSummary="在这个联网互通、全天候监视和智能安检的现代世界里，你需要一个能让复杂的事情变得简单的专家。当你想要那些炮塔关闭或机器人瘫痪的时候，请呼叫专家."

[Scout X2UniversalSoldierClassInfo]
ClassSpecializationTitle=侦察兵
ClassSpecializationSummary="快速、安静和敏锐的侦察兵很善于让你知道下一个区域的情况."

[Medic X2UniversalSoldierClassInfo]
ClassSpecializationTitle=医疗兵
ClassSpecializationSummary="一只全新兵队伍还是一只经验丰富的老兵团队？中毒、瘫痪,刺伤，你需要医疗兵."

[Gunslinger X2UniversalSoldierClassInfo]
ClassSpecializationTitle=快枪手
ClassSpecializationSummary="在这个无人侦察机和自动反器材步枪的时代，手枪也许被忽视了，但快枪手对扳机技术的掌握可以在关键时刻扭转局势。"

[Skirmisher X2UniversalSoldierClassInfo]
ClassSpecializationTitle=散兵
ClassSpecializationSummary="没有什么能像开颅刃那样能摧毁美好的一天。散兵善于在小规模战斗使用高射速枪和勾爪解决敌人。不管敌人给他带来什么威胁，他都准备好了."

[Saboteur X2UniversalSoldierClassInfo]
ClassSpecializationTitle=爆破专家
ClassSpecializationSummary="有时仅仅把火箭发射器带到战场上是不够的。不，你需要一个爆破专家，他可以精准地投下地雷，或者在一个地下室的化学实验室里调和X4炸药。当一颗手榴弹无法破坏目标的时候，打电话给爆破专家吧."

[Spotter X2UniversalSoldierClassInfo]
ClassSpecializationTitle=观测员
ClassSpecializationSummary="每一队起义军都需要有人来让队伍保持警惕。陷阱和诡计就是这些观测员的对手。找到并标记这些障碍，以确保行动顺利."

[RpgRocketeer X2UniversalSoldierClassInfo]
ClassSpecializationTitle=火箭兵
ClassSpecializationSummary="能使用火箭发射器来达到毁灭性效果的队员，对大群敌人造成伤害，以及粉碎敌人护甲和破坏建筑物."

[RpgPurifier X2UniversalSoldierClassInfo]
ClassSpecializationTitle=净化者
ClassSpecializationSummary="能成使用火焰喷射器来达到毁灭性效果的队员，点燃战场和所有过于接近的敌人."

[Enforcer X2UniversalSoldierClassInfo]
ClassSpecializationTitle=执行人
ClassSpecializationSummary="执行人利用他的电弧发射器来禁锢和锁定敌人，给团队创造有利条件，或者确保敌人在被执行人队友瞄准时是不能移动的活靶子"

[Marauder X2UniversalSoldierClassInfo]
ClassSpecializationTitle=掠夺者
ClassSpecializationSummary="未经训练，不稳定和释放！掠夺者，使用短管霰弹枪的专家。近距离致命，每一枪都很重要."


[UIPersonnel_SoldierListItemDetailed]
m_strServeredHead="<font color='#bf1e2e'><b>需要头部增强</b></font>"
m_strServeredTorso="<font color='#bf1e2e'><b>需要胸部增强</b></font>"
m_strServeredArms="<font color='#bf1e2e'><b>需要手部增强</b></font>"
m_strServeredLegs="<font color='#bf1e2e'><b>需要腿部增强</b></font>"

[XGLocalizedData_RPG]
SelectClassTitle="职业名称"
SelectClassIcon="职业图标"
SelectClassDescription="职业描述"
ResetClassInsignia="重置自定义职业徽章"

SelectClassTitleTooltip="选择自定义职业名称。这将覆盖基于专业化的自动分配"
SelectClassIconTooltip="选择自定义职业图标。这将覆盖基于专业化的自动分配"
SelectClassDescriptionTooltip="选择自定义职业描述。这将覆盖基于专业化的自动分配"
ResetClassInsigniaTooltip="这将重置自定义职业图标、名称和描述，这些将再次由默认行为设置"

AbilityWeaponRestrictions="兼容:"

SpecializationPrimaryShort="P"
SpecializationSecondaryShort="S"
SpecializationComplementaryShort="C"

SpecializationPrimary="主职业（P）:"
SpecializationSecondary="副职业（S）:"
SpecializationComplementary="补职业（C）:"

AllowedWeaponCategoriesPrimary="主武器:"
AllowedWeaponCategoriesSecondary="副武器:"

UtilityCatPistol="自动手枪"
UtilityCatSidearm="自动手枪"
UtilityCatSword="近战武器"
UtilityCatGremlin="小精灵"
UtilityCatPsiamp="灵能增幅器"
UtilityCatGrenadeLauncher="榴弹发射器"
UtilityCatClaymore="阔剑地雷"
UtilityCatWristblade="开颅刃"
UtilityCatArcthrower="电弧发射器"
UtilityCatCombatknife="近战武器"
UtilityCatHolotargeter="全息瞄准器"
UtilityCatSawedoffshotgun="短管霰弹枪"
UtilityCatLWGauntlet="XCOM 臂套"

m_strCategoryRestricted=已经装备一个 <XGParam:StrValue0/!WeaponCat/>
m_strAbilityRequired=技能 <XGParam:StrValue0/!Ability/> 需求

strSWO_SpecRoulette_Description="[RPGO] 职业轮盘赌：随机3个职业树作为你的新职业"
strSWO_SpecRoulette_Tooltip="取消全套职业，在晋升到二等兵时随机3个职业. \n 可与 技能轮盘赌 ，起源 和 指挥官选择 同时启用."

strSWO_TrainingRoulette_Description="[RPGO] 技能轮盘赌：职业中的技能顺序是随机的（不要单独启用，卡的一批。配合职业轮盘赌不会卡）"
strSWO_TrainingRoulette_Tooltip="随机化每个职业的特殊技能顺序。作为前置的技能留在同一个位置. \n 可与 职业轮盘赌 ，起源 和 指挥官选择 同时启用."

strSWO_CommandersChoice_Description="[RPGO] 指挥官选择：选择有限数量的职业"
strSWO_CommandersChoice_Tooltip="在晋升二等兵时，您可以选择有限数量的职业. \n 可与 职业轮盘赌 ，起源 和 技能轮盘赌 同时启用."

strSWO_Origins_Description="[RPGO] 起源：选择士兵的起始能力"
strSWO_Origins_Tooltip="在晋升二等兵时，您可以选择士兵的起始能力. \n 可与 职业轮盘赌 ，指挥官选择 和 技能轮盘赌 同时启用."

strRPGO_SWO_RandomClasses_Description = "[RPGO] 随机职业：随机分配一个主职、一个次职和一些补职（武器限制 互斥）"
strRPGO_SWO_RandomClasses_Tooltip = "在晋升二等兵时，RPGO会随机为士兵分配一个主职业、一个次职业和一些补职业。如果你也使用武器限制，建议不要使用职业轮盘赌，因为这将确保你的士兵有一个主要和次要武器类别。可以与任何其他第二波选项结合使用"

strRPGO_SWO_WeaponRestriction_Description = "[RPGO] 武器限制：士兵专精将限制你能使用的武器类别（随机职业 互斥）"
strRPGO_SWO_WeaponRestriction_Tooltip = "启用此选项可根据RPGO士兵选择的专精将其限制为某些武器类别。专精将允许您访问主要和/或次要武器槽的某些武器类别。可以与任何其他rpgo第二波选项结合使用。激活随机类后，您的士兵将只有一个指定的主要和一个次要专精."

ItemCategoryRifle="步枪"
ItemCategorySniperRifle="狙击步枪"
ItemCategoryShotgun="霰弹枪"
ItemCategoryCannon="加农炮"
ItemCategoryVektorRifle="维克托步枪"
ItemCategoryBullpup="无托式机枪"
ItemCategoryPistol="手枪"
ItemCategorySidearm="自动手枪"
ItemCategorySword="近战武器"
ItemCategoryGremlin="小精灵"
ItemCategoryPsiamp="灵能增幅器"
ItemCategoryGrenadeLauncher="榴弹发射器"
ItemCategoryClaymore="阔剑地雷"
ItemCategoryWristblade="开颅刃"
ItemCategoryArcthrower="电弧发射器"
ItemCategoryCombatknife="战术小刀"
ItemCategoryHolotargeter="全息瞄准器"
ItemCategorySawedoffshotgun="短管霰弹枪"
ItemCategoryLWGauntlet="XCOM 臂套"
ItemCategoryEmpty="空"
ItemCategoryUtility="通用"
ItemCategoryTech="技术"
ItemCategoryConventional="传统"
ItemCategoryPlated="镀层"
ItemCategoryPowered="动力"
ItemCategorySparkrifle="Spark 步枪"
ItemCategoryGauntlet="臂套"
ItemCategoryBasic="基础"
ItemCategoryUnknown="其他"
ItemCategoryMedium="中型"
ItemCategoryLight="轻型"
ItemCategoryHeavy="重型"
ItemCategoryRocketLauncher="火箭发射器"

[UIChooseSpecializations]
m_strTitlePool=选择职业
m_strInventoryLabelPool=可选职业:
m_strTitleChosen=所选职业
m_strInventoryLabelChosen=可移除职业:
m_strChoose=选择
m_strRemove=移除
m_strItemChosen=您已经选择了此职业
m_strItemOwned=随机职业
m_strItemLimitReached=你不能再选择任何职业了
m_strItemNotRemovable=无法删除随机职业
m_strComplementarySpecializationInfo=强制补职业:

[UIChooseAbilities]
m_strTitlePool=选择能力
m_strInventoryLabelPool=可选能力:
m_strTitleChosen=所选能力
m_strInventoryLabelChosen=可移除能力:
m_strChoose=选择
m_strRemove=移除
m_strItemChosen=您已经选择了此能力
m_strItemOwned=随机能力
m_strItemLimitReached=你不能再选择任何能力了
m_strItemNotRemovable=无法删除随机能力

[UIStartingAbilitiesIconList]
m_strStartingAbilities=启动能力

[RPGOVersionTemplate]
strRPGOVersion="Musasis RPG Overhaul v%MAJOR.%MINOR.%PATCH"

[UISL_UIShell_RPGO]
strTitleCommunityHighlanderMissing="缺失 X2WotCCommunityHighlander"
strCommunityHighlanderMissing="RPGO 需要 X2WotCCommunityHighlander 前置. 确保在开始或加载活动之前启用了该 mod."
strTitleIncompatibleMod="RPGO 检测到一些不兼容的模组."
strIncompatibleModsFound="请删除以下mod并重新启动，否则RPGO将无法正常工作:"
strTitleSWOInfo="RPGO 更新"
strSWOInfo="\n<font color='#1bad62'>Two new Second Wave Options!</font>\n<font color='#1bad62'>Random Classes</font> - Generates functional random classes by using a algorithm instead of the pure rng of Specialization Roulette\n<font color='#1bad62'>Weapon Restrictions</font> - Specializations will determine which weapons your soldiers can use\n\nThere are also changes to other Second Wave Options: Specialization Roulette and Training Roulette can no longer be changed in running campaigns anymore because that caused issues. This can be reversed in XComGameData.ini on your own risk.\n\n<font color='#1bad62'>To the mod authors of rpgo plugin mods</font>\nPlease checkout the steam 'Create a specialization from a class mod' discussion for infos how you can enable these new options for your plugin mod.\n\n<font color='#1bad62'>CREDITS AND THANKS to Iridar who contributed the new second wave options!</font>\n\nRegards, Musashi"
strTitleRequiredMod="RPGO检测到一些缺失的必需模组."
strRequiredModsMissing="请激活以下mod并重新启动，否则RPGO将无法正常工作:"

[UISL_ShellSplash]
strRequiredModsTooltip="缺失前置MOD:"
strIncompatibleModsTooltip="检测到不兼容的模组:"
strRequiredLoadedModsTooltip="加载所需的模组:"

[RPGO_UIArmory_PromotionHero]
m_strMutuallyExclusive="互斥于:"

[RPGO_MCM_Builder]
WEAPON_SETTINGS_PAGE_TITLE="RPGO 通用设置"
WEAPON_SETTINGS_PAGE_LABEL="RPGO 通用设置"

WEAPON_SETTINGS_GROUP_LABEL="武器改变"

PATCH_BULLPUPS_LABEL="改变无托式机枪"
PATCH_BULLPUPS_TOOLTIP="允许 RPGO 改变无托式机枪"

PATCH_SHOTGUNS_LABEL="改变霰弹枪"
PATCH_SHOTGUNS_TOOLTIP="允许 RPGO 改变霰弹枪"

PATCH_CANNONS_LABEL="改变加农炮"
PATCH_CANNONS_TOOLTIP="允许 RPGO 改变加农炮"

PATCH_SNIPER_RIFLES_LABEL="改变狙击步枪"
PATCH_SNIPER_RIFLES_TOOLTIP="允许 RPGO 改变狙击步枪"

PATCH_PISTOLS_LABEL="改变手枪"
PATCH_PISTOLS_TOOLTIP="允许 RPGO 改变手枪"

PATCH_AUTO_PISTOLS_LABEL="改变自动手枪"
PATCH_AUTO_PISTOLS_TOOLTIP="允许 RPGO 改变自动手枪"

PATCH_SAWEDOFF_SHOTGUN_LABEL="改变短管霰弹枪"
PATCH_SAWEDOFF_SHOTGUN_TOOLTIP="允许 RPGO 改变短管霰弹枪"

PATCH_VECTOR_RIFLES_LABEL="改变维克托步枪"
PATCH_VECTOR_RIFLES_TOOLTIP="允许 RPGO 改变维克托步枪"

PATCH_DEFAULTWEAPON_UPGRADESLOTS_LABEL="更改默认升级槽"
PATCH_DEFAULTWEAPON_UPGRADESLOTS_TOOLTIP="将所有升级槽设置为3"

PATCH_FULLAUTOFIRE_LABEL="添加自动射击能力"
PATCH_FULLAUTOFIRE_TOOLTIP="将自动射击技能添加到所有匹配自动射击武器类别的武器中"

ATTACHMENT_SETTINGS_GROUP_LABEL="附件更改"

PATCH_HAIR_TRIGGERS_LABEL="改变微力扳机"
PATCH_HAIR_TRIGGERS_TOOLTIP="允许 RPGO 改变微力扳机"

PATCH_LASER_SIGHTS_LABEL="改变激光瞄准器"
PATCH_LASER_SIGHTS_TOOLTIP="允许 RPGO 改变激光瞄准器"

PATCH_STOCKS_LABEL="改变枪托"
PATCH_STOCKS_TOOLTIP="允许 RPGO 改变枪托"

PATCH_SCOPES_LABEL="改变瞄准镜"
PATCH_SCOPES_TOOLTIP="允许 RPGO 改变瞄准镜"

PATCH_AUTOLOADERS_LABEL="改变自动装填器"
PATCH_AUTOLOADERS_TOOLTIP="允许 RPGO 改变自动装填器"

SWO_SETTINGS_PAGE_TITLE="RPGO 第二波选项"
SWO_SETTINGS_PAGE_LABEL="RPGO 第二波选项"

SWO_COMMANDERS_CHOICE_LABEL="[RPGO] 指挥官选择"
SWO_SPECIALIZATION_ROULETTE_LABEL="[RPGO] 职业轮盘赌 / 随机职业"
SWO_TRAINING_ROULETTE_LABEL="[RPGO] 技能轮盘赌"
SWO_ORIGINS_LABEL="[RPGO] 起源"
SWO_WEAPON_RESTRICTIONS_LABEL="[RPGO] 武器限制"

SPEC_ROULETTE_RANDOM_SPEC_COUNT_LABEL="职业专业化"
SPEC_ROULETTE_RANDOM_SPEC_COUNT_TOOLTIP="二等兵上随机生成的职业数量"

COMMANDERS_CHOICE_SPEC_COUNT_LABEL="职业专业化"
COMMANDERS_CHOICE_SPEC_COUNT_TOOLTIP="你可以选择每个士兵晋升的职业数量"

SPEC_ROULETTE_RANDOM_SPEC_COUNT_COMBI_LABEL="同时启用"
SPEC_ROULETTE_RANDOM_SPEC_COUNT_COMBI_TOOLTIP="如果同时启用职业轮盘赌和指挥官选择，则随机职业化的数量"

COMMANDERS_CHOICE_SPEC_COUNT_COMBI_LABEL="同时启用"
COMMANDERS_CHOICE_SPEC_COUNT_COMBI_TOOLTIP="如果同时启用职业轮盘赌和指挥官选择，则选择的职业数量"

COMMANDERS_CHOICE_RANDOM_POOL_ENABLED_LABEL="职业随机池"
COMMANDERS_CHOICE_RANDOM_POOL_ENABLED_TOOLTIP="启用后，您只能从有限的随机职业池中进行选择，而不是所有可用的职业."

COMMANDERS_CHOICE_RANDOM_POOL_COUNT_LABEL="职业随机池大小"
COMMANDERS_CHOICE_RANDOM_POOL_COUNT_TOOLTIP="这决定了随机池的大小。它应该总是大于上面的指挥官选择和随机职业的数量。如果您启用了随机类第二波选项，它的算法将用于随机化."

TRAINING_ROULETTE_MIN_RANK_LABEL="Min 军衔"
TRAINING_ROULETTE_MIN_RANK_TOOLTIP="从这个军衔开始随机化"

TRAINING_ROULETTE_MAX_RANK_LABEL="Max 军衔"
TRAINING_ROULETTE_MAX_RANK_TOOLTIP="随机化这个军衔的能力"

ORIGINS_CHOICE_ABILITY_COUNT_LABEL="选择能力"
ORIGINS_CHOICE_ABILITY_COUNT_TOOLTIP=" 你想在二等兵选择多少个起始能力"

ORIGINS_ADDITIONAL_RANDOM_ABILTIES_LABEL="随机能力"
ORIGINS_ADDITIONAL_RANDOM_ABILTIES_TOOLTIP="将此数量的随机能力添加到所选能力之上"

ORIGINS_RANDOM_POOL_ENABLED_LABEL="能力随机池"
ORIGINS_RANDOM_POOL_ENABLED_TOOLTIP="启用后，您只能从有限的随机能力池中进行选择，而不是所有可用的起始能力"

ORIGINS_RANDOM_POOL_COUNT_LABEL="能力随机池大小"
ORIGINS_RANDOM_POOL_COUNT_TOOLTIP="这决定了随机池的大小。它应该总是大于上面选择和随机能力的总和"

WEAPON_RESTRICTIONS_ALWAYS_ALLOW_ASSAULT_RIFLES_LABEL="始终允许使用突击步枪"
WEAPON_RESTRICTIONS_ALWAYS_ALLOW_ASSAULT_RIFLES_TOOLTIP="无论职业，所有士兵都可以使用突击步枪类别的武器"



[X2DownloadableContentInfo_RPGO_PromotionScreen]
strNoUnitSelected =	":>> 错误: 没有选择单位-从单位的军械库屏幕输入此命令."
strClassNotFound = ":>> 错误: 士兵职业明确, 但是 '<ClassName/>' 不存在."
strIncorrectCharacterTemplate = ":>> 错误: 士兵职业明确, 但选定的士兵不是 '<ClassName/>' 所需."
strIncorrectRankValue = ":>> 错误: 输入的等级无效."
strCantRespecRookie = ":>> 错误: 无法重新构建新兵 - 升级该士兵或者指定一个职业."
strInvalidCombatInt = ":>> 错误: 输入战斗智商无效."
strNoValidUnit = ":>> 错误: 没有选择有效的单位."

strCappingRank = ":>> 注意: 请求级别超过最大级别上限级别."

strRankSet = ":>> 成功: 单位等级成功设置为等级 <RankLevel/>."
strClassSet = ":>> 成功: 士兵类别成功设置为 '<ClassName/>' class."
strComIntSet = ":>> 成功: 士兵战斗智商成功设置为 '<RankLevel/>'."
strWeaponReloaded = ":>> 成功: 选择的单位的主武器重新装备."